Revit 2027 API
BuiltInFailures.CreationFailures.CannotMakeSurfaceWarn Property
 Can't construct surface.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotMakeSurfaceWarn { get; }
Public Shared ReadOnly Property CannotMakeSurfaceWarn As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotMakeSurfaceWarn {
	FailureDefinitionId^ get ();
}
static member CannotMakeSurfaceWarn : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.CreationFailures Class
Autodesk.Revit.DB Namespace